# FL Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..FL Property
SymbolTypeId Class See Also
---
Symbol fL, indicating unit Footlamberts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FL { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FL As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FL {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace